import { Song } from './types';

export const FEATURED_SONGS: Song[] = [
  {
    id: 'saran-01',
    title: 'รออยู่อย่างนั้น',
    artist: 'SARAN (feat. Z9, SIMON)',
    album: 'Single',
    duration: '4:15',
    coverUrl: 'https://i.ytimg.com/vi/K8LGfyFIJiQ/maxresdefault.jpg',
    genre: 'Hip Hop',
    audioUrl: '/saran01.mp3',
    notes: `Intro / E G#m / C#m Bm E7 / A G#m / F#m B /

             E               G#m                              C#m
* ก็เพราะเธอรู้ว่าฉันยังรอ รอเธออยู่อย่างนั้น และฉันก็ยัง Smoke ที่เดิม
                    Bm           E7          A
และฟังเพลงโปรดเราอยู่ซ้ำๆ บุหรี่หมดไปไม่รู้กี่ซอง
          G#m                           F#m                             B
ยอมย้อมใจซ้ำๆ และกลิ่นน้ำหอมอยู่บนที่นอน ไม่ใช่ของใครทั้งนั้น
                   E              G#m         C#m                     Bm
ก็เพราะว่ามันเป็นตอนที่นอนด้วยกัน ตอนที่เราเต้นรำกันใต้แสงจันทร์
 E7     A                    G#m                  F#m                             B
ตอนที่ฉันได้จูบกับเธอครั้งแรก ตอนเธอมองตาแล้วบอกว่ารักกับฉันแค่คนเดียว

                           E                  G#m                  C#m                               Bm
เราไม่ได้เจอกันมาตั้งนาน ก็รู้เธอนั้นสบายดี อยู่ในงานวิวาห์ Baby your my shawty
E7             A                                     G#m
เดินอยู่คนละทาง ก็คงต้องห่างเธอไม่ต้อง Worry
                  F#m                                       B
และถ้าหากเธอเหงาถ้าไม่มีเขา แล้วเธอค่อย Call me
                           E                                    G#m
แม้ว่าตอนสุดท้ายเป็นคนที่โดนทำร้าย มันก็คงและฉันที่ต้องกลับกลั้นน้ำตา
       C#m                                                                Bm                        E7
ไม่รู้ว่าผมนั้นมีส่วนผิดตรงไหน เพราะสุดท้ายผมก็รักแม้จะจากมาตั้งนาน
             A                                           G#m
ที่บอกว่ารักเธอเอามันกลับไปซะ เพราะไอ้คนที่ชนะไม่มีฉันในนิทาน
        F#m                                             B
Yeah ขอให้โชคดีแล้วกันนะ เธอมีพักที่รักฉันต้องลา

      E             G#m      C#m                    Bm  E7     A          G#m         F#m
** ฉันคงต้องลาเธอไปไกล เราสองคนไปต่อไม่ไหว เพราะรู้ว่าเธอมีเขาทั้งใจ
            B
และสุดท้ายก็ต้องทำใจ

( * )`
  },
  {
    id: 'purpeech-01',
    title: 'อาจเป็นเพราะฉันเอง (me.)',
    artist: 'PURPEECH',
    album: 'Single',
    duration: '4:50',
    coverUrl: 'https://img.youtube.com/vi/y687Um7b54E/maxresdefault.jpg',
    genre: 'Indie Pop',
    audioUrl: '/อาจเป็นเพราะฉันเอง (me.) - PURPEECH.mp3',
    notes: `Intro / F / Cmaj7 / Dm / Cmaj7 / F / Cmaj7 / Dm / G /

        C              Em
อาจเป็นเพียงอาการเดิม ๆ ที่ใครเคยพบเห็นบ้างบางเวลา
    Am                 G
อาจเป็นเพียงอารมณ์อ่อนล้า..ที่พัดพาให้ใจอ่อนไหว
        C              Em
อาจเป็นช่วงเวลาดี ๆ ที่ทำให้เรานั้นคิดถึงใคร
        F              Fm
เธอรู้สึกเหมือนกันใช่ไหม เธอคิดเหมือนกันฉันใช่ไหม

Instru / C / Em / Am / G /

        C              Em
อาจเป็นเพียงแค่คำบางคำ..ที่เธอเคยพูดในบางเวลา
    Am                 G
อาจเป็นเพียงแววตาที่หวาน..เคยจ้องมองแค่เพียงตัวฉัน
        C              Em
อาจเป็นเพียงแค่เพียงบางเพลง..ยังซ่อนความหมายให้คิดถึงกัน
        F              Fm
แต่เธออยู่ที่ไหน.. และเธออยู่ที่ไหน..

        C              Em
หรืออาจเป็นเพราะฉันเอง ไม่ใช่เพราะ คำที่เธอนั้นบอก
    F              Fm
ว่ารักจะอยู่ รักฉันอยู่ อยู่อย่างนี้ตลอดไป
        C              Em
คงอาจเป็นเพราะฉันเอง มีเพียงแค่เสียงกระซิบของหัวใจ
    F              Fm
ว่ายังรักเธอ.. จากตรงนี้ไม่มีฉัน แค่หวังให้เธอพบคนที่ดี

Instru / Dm / G / Em / Am / Dm / G / C / Bb /
       / Dm / G / Em / Am / Dm / G / C / C7 /

F           Fm          Em          Am
ฤดูกาลเปลี่ยนไป แต่หัวใจไม่เคยเจอ กี่เทศกาลผ่านมาแต่ฉันไม่พบเธอ
Dm          Bb          Em      Am
ช่วงเวลาที่ดีเก็บไว้อยู่เสมอ ให้เป็นเธอได้ไหม.. จะได้ไหม
Dm          Bb          Em      Am
ไม่เป็นไร เมื่ออย่างน้อยมันก็เคยมี ฉันดีใจที่อย่างน้อยมันก็เคยดี
Dm          Bb          G
ได้รู้จักเธอมา ได้ทักทายอย่างดี ไม่เป็นไร.. แค่แอบเหงาบางที

        C              Em             F     Fm
คงอาจเป็นเพราะฉันเอง ไม่ใช่เพราะคำที่เธอนั้นตอบ ยังรักจะอยู่..
        C              Em             F  Fm
คงอาจเป็นเพราะฉันเอง ไม่ใช่เพราะรักใคร อู้หู..
        C              Em
นี่คือเสียงกระซิบของหัวใจ จากคนที่คอยอยู่เรื่อยไป
        F              Fm
ความหมายของความห่วงใย อาจทำให้ใจของเราห่างกัน
        C              Em             F        Fm
วันที่เข็มของนาฬิกา..หยุดเดินตามหากันอยู่อย่างนั้น หู..จากตรงนี้ไม่มีฉันก็แค่หวังให้เธอพบคนที่ดี..

Outro / F / Cmaj7 /`
  },
  {
    id: 'lomosonic-01',
    title: 'ขอ (WARM EYES)',
    artist: 'LOMOSONIC',
    album: 'Fireworks',
    duration: '6:31',
    coverUrl: 'https://img.youtube.com/vi/tUuqWFExZgY/maxresdefault.jpg',
    genre: 'Rock',
    audioUrl: '/ขอ (Warm Eyes) - Lomosonic.mp3',
    notes: `INTRO : | E | E | A | A |
        | E | E | A | A |

  E                                       A
จากวันนั้น ฉันไม่รู้ว่านานเท่าไหร่ ที่เราได้จากกัน
  E                                       A
เหตุผลใดๆ ไม่ใช่เรื่องใหญ่ในวันนี้
  E                                       A
ได้มองตา ตาดวงเดิมคู่นั้นอบอุ่นเหลือเกิน
  E                                       A
เธอกับฉัน ความทรงจำมากมาย..

           E                                          A
* ไม่อยากจะขอ ให้เวลานี้เป็นของเรา ไม่ยากจะถาม ว่าเราจะเหมือนเดิมได้ไหม
            C#m           B               A
แค่อยากให้รู้ ที่ผ่านมานั้น ฉันคิดถึงเธอสุดหัวใจ..

Instru : | E | E | A | A |

  E                                       A
ไม่ยากจะถาม ว่าเราจะเหมือนเดิมได้ไหม
  E                                       A
แค่อยากให้รู้ ที่ผ่านมานั้น ฉันคิดถึงเธอสุดหัวใจ..
            C#m      G#m       A            E
** กว่าที่จะรู้ ว่าตัวเธอนั้นสำคัญเท่าไร
            C#m      G#m       A            E
และก็ได้รู้ ในวันที่ฉัน เสียเธอไป..

Instru : | E | E | A | A |
         | C#m | B | A | A |

( * )

           E                                          A
ไม่อยากจะขอ ให้เวลานี้เป็นของเรา ไม่ยากจะถาม ว่าเราจะเหมือนเดิมได้ไหม
            C#m           B               A
แค่อยากให้รู้ ที่ผ่านมานั้น ฉันคิดถึงเธอสุดหัวใจ..

OUTRO : | E | E | A | A |
         | C#m | B | A | A |
         | E | E | A | A |
         | C#m | B | A | A |
         | E | E | A | A |
         | C#m | B | A | A |
         | E | E | A | A |
         | C#m | B | A | A | E |`
  },
  {
    id: 'atom-01',
    title: 'PLEASE',
    artist: 'Atom ชนกันต์',
    album: 'CYANIDE',
    duration: '5:27',
    coverUrl: 'https://img.youtube.com/vi/GYpzzbVRrsk/maxresdefault.jpg',
    genre: 'Soul / Pop',
    audioUrl: '/atom_please.mp3',
    notes: `Dmaj7         Amaj7   Dmaj7         Amaj7
รู้ฉันรู้อย่างไรก็คงไม่ต่าง  รู้ฉันรู้อย่างไรเธอก็เลือกเขา
Dmaj7         C#m      F#m        Bm           Dm     E
รู้ถึงฉันขอร้องยังไง เธอคงต้องลืมเรื่องของเรา เพราะว่าเขาดีกว่า เพราะเขาสําคัญกว่า

Dmaj7         Amaj7   Dmaj7         Amaj7
รู้เธอมีเหตุผลอะไรสักอย่าง ที่ทําให้เธอไม่คิดจะอยู่กับฉัน
Dmaj7         C#m      F#m        Bm           Dm     E
อาจเป็นเพราะเธอแค่เหงาใจ ในวันที่เราพบกัน เธอแค่มีความสุข แต่ว่าเธอไม่ได้รักกัน

      Bm    C#m   Dmaj7    C#m
* (แต่)(เพราะ)ฉัน รัก รักเธอไปแล้วทั้งใจ
Bm  C#m     Dmaj7        Dm          E
รู้ ฉันรู้ว่าเธอต้องไป แต่อยากจะขอร้องเธออีกครั้ง

      Amaj7   C#m7 Bm        Dm   E
** โปรด รักฉันรักฉันเถอะนะ จะไม่ทําให้เธอเสียใจ
Amaj7 C#m7 Bm        Dm E
รู้ ฉันสู้เขาไม่ไหว เทียบกับใครที่เธอ..มี
      Amaj7       C#m7  Em        A
แต่เลือกฉัน เลือกฉันได้ไหม ฉันจะดูแลเธอให้ดี
      Dmaj7   C#m Cm        Bm        Dm E
โปรดถามใจเธออีกที    เพราะทั้งใจฉันมันยังมี แค่เธอ

Instru / Dmaj7 C#m / Bm C#m / Dmaj7 C#m / Bm C#m D E / E /

Dmaj7              Amaj7   Dmaj7             Amaj7
รู้ว่าระหว่างเรานั้นมีบางอย่าง ฉันรู้ว่าใจหนึ่งเธอก็ยังมีฉัน
Dmaj7         C#m      F#m        Bm           Dm     E
รู้ทุกครั้งที่เรามองตา ยังทําให้ใจของเธอสั่น ทุกอย่างที่ผ่านมานั้นมันคือเรื่องจริง

( * , ** )

Instru / Dmaj7 / Dm / C#m / F#7 / Bm C#m / Dmaj7 C#m / Bm / Dm E /

     Amaj7        Bm             Amaj7       Dm        E
โปรด รักฉันรักฉันเถอะนะ จะไม่ทําให้เธอเสียใจ รู้ ฉันสู้เขาไม่ไหว เทียบกับใครที่เธอมี

( ** )

Outro / Dmaj7 C#m / Bm C#m / Dmaj7 C#m / Bm C#m D E / A /`
  },
  {
    id: 'cocktail-01',
    title: 'ช่างมัน',
    artist: 'COCKTAIL',
    album: 'The Lords of Misery',
    duration: '5:12',
    coverUrl: 'https://img.youtube.com/vi/UsnIyScLe-s/maxresdefault.jpg',
    genre: 'Rock',
    audioUrl: '/ช่างมัน - COCKTAIL.mp3',
    notes: `Intro / E G#m / C#m Bm E7 / A G#m / F#m B /

             E               G#m                              C#m
* ก็เพราะเธอรู้ว่าฉันยังรอ รอเธออยู่อย่างนั้น และฉันก็ยัง Smoke ที่เดิม
                    Bm           E7          A
และฟังเพลงโปรดเราอยู่ซ้ำๆ บุหรี่หมดไปไม่รู้กี่ซอง
          G#m                           F#m                             B
ยอมย้อมใจซ้ำๆ และกลิ่นน้ำหอมอยู่บนที่นอน ไม่ใช่ของใครทั้งนั้น
                   E              G#m         C#m                     Bm
ก็เพราะว่ามันเป็นตอนที่นอนด้วยกัน ตอนที่เราเต้นรำกันใต้แสงจันทร์
 E7     A                    G#m                  F#m                             B
ตอนที่ฉันได้จูบกับเธอครั้งแรก ตอนเธอมองตาแล้วบอกว่ารักกับฉันแค่คนเดียว

                           E                  G#m                  C#m                               Bm
เราไม่ได้เจอกันมาตั้งนาน ก็รู้เธอนั้นสบายดี อยู่ในงานวิวาห์ Baby your my shawty
E7             A                                     G#m
เดินอยู่คนละทาง ก็คงต้องห่างเธอไม่ต้อง Worry
                  F#m                                       B
และถ้าหากเธอเหงาถ้าไม่มีเขา แล้วเธอค่อย Call me
                           E                                    G#m
แม้ว่าตอนสุดท้ายเป็นคนที่โดนทำร้าย มันก็คงและฉันที่ต้องกลับกลั้นน้ำตา
       C#m                                                                Bm                        E7
ไม่รู้ว่าผมนั้นมีส่วนผิดตรงไหน เพราะสุดท้ายผมก็รักแม้จะจากมาตั้งนาน
             A                                           G#m
ที่บอกว่ารักเธอเอามันกลับไปซะ เพราะไอ้คนที่ชนะไม่มีฉันในนิทาน
        F#m                                             B
Yeah ขอให้โชคดีแล้วกันนะ เธอมีพักที่รักฉันต้องลา

      E             G#m      C#m                    Bm  E7     A          G#m         F#m
** ฉันคงต้องลาเธอไปไกล เราสองคนไปต่อไม่ไหว เพราะรู้ว่าเธอมีเขาทั้งใจ
            B
และสุดท้ายก็ต้องทำใจ

( * )`
  }
];
export const Logo = () => (
  <div className="flex items-center gap-2 group cursor-pointer"> {/* เพิ่ม group และ cursor */}
    <div className="w-10 h-10 bg-amber-500 rounded-full flex items-center justify-center border-2 border-amber-300 shadow-lg shadow-amber-500/20 group-hover:rotate-12 transition-transform duration-300"> 
      {/* เพิ่ม group-hover:rotate-12 เพื่อให้ไอคอนหมุนนิดๆ เวลาชี้ */}
      <i className="fas fa-clover text-slate-900 text-lg"></i>
    </div>
    <div className="flex flex-col">
      <span className="text-xl font-black tracking-tighter text-amber-500 leading-none group-hover:text-amber-400 transition-colors">
        CASINO
      </span>
      <span className="text-sm font-bold tracking-widest text-white leading-none">
        888
      </span>
    </div>
  </div>
);